NgQunz/STM32/STM32_MQ2_FLASH/User/flash.c
#include "flash.h"
#include "stm32f10x.h"

static void Flash_Unlock(void) {
    if (FLASH->CR & FLASH_CR_LOCK) {
        FLASH->KEYR = FLASH_KEY1;
        FLASH->KEYR = FLASH_KEY2;
    }
}

static void Flash_Lock(void) {
    FLASH->CR |= FLASH_CR_LOCK;
}

static void Flash_WaitBusy(void) {
    while (FLASH->SR & FLASH_SR_BSY);
}

static void Flash_ErasePage(uint32_t address) {
    Flash_WaitBusy();
    FLASH->CR |= FLASH_CR_PER;
    FLASH->AR = address;
    FLASH->CR |= FLASH_CR_STRT;
    Flash_WaitBusy();
    FLASH->CR &= ~FLASH_CR_PER;
}

static void Flash_WriteWord(uint32_t address, uint32_t data) {
    Flash_WaitBusy();
    FLASH->CR |= FLASH_CR_PG;

    *(volatile uint16_t*)address = (uint16_t)(data & 0xFFFF);
    Flash_WaitBusy();
    *(volatile uint16_t*)(address + 2) = (uint16_t)(data >> 16);
    Flash_WaitBusy();

    FLASH->CR &= ~FLASH_CR_PG;
}

void Flash_SaveValue(uint32_t address, uint32_t value) {
    Flash_Unlock();
    Flash_ErasePage(address);
    Flash_WriteWord(address, value);
    Flash_Lock();
}

uint32_t Flash_ReadValue(uint32_t address) {
    return *(volatile uint32_t*)address;
}
